<a href="https://colab.research.google.com/github/chohyungrae/Python-Study-/blob/master/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B0%9C%EC%9A%94_%EB%B0%8F_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

https://www.youtube.com/watch?v=uUf8enbyaas&list=PLS8gIc2q83OjMOLn9h6QZGe48xHft-BBA

In [7]:
import pandas as pd

df = pd.read_csv('/content/LEC_01_data.csv')
df # df 는 테이블 형태의 DataFrame

   Number   Name Country  Age        Job
0       0   John     USA   31    Student
1       1  Sabre  France   33     Lawyer
2       2    Kim   Korea   28  Developer
3       3   Sato   Japan   40       Chef
4       4    Lee   Korea   36  Professor
5       5  Smith     USA   55        CEO
6       6  David     USA   48     Banker

In [8]:
type(df)  # df 데이터 타입 확인

pandas.core.frame.DataFrame

In [9]:
type(df.Name)   # df.Name 데이터 타입 확인

pandas.core.series.Series

In [10]:
df

   Number   Name Country  Age        Job
0       0   John     USA   31    Student
1       1  Sabre  France   33     Lawyer
2       2    Kim   Korea   28  Developer
3       3   Sato   Japan   40       Chef
4       4    Lee   Korea   36  Professor
5       5  Smith     USA   55        CEO
6       6  David     USA   48     Banker

In [11]:
df_job = df['Job']

df_job

0      Student
1       Lawyer
2    Developer
3         Chef
4    Professor
5          CEO
6       Banker
Name: Job, dtype: object

In [12]:
df_country_job = df[ ['Country', 'Job'] ]

df_country_job

  Country        Job
0     USA    Student
1  France     Lawyer
2   Korea  Developer
3   Japan       Chef
4   Korea  Professor
5     USA        CEO
6     USA     Banker

In [13]:
df

   Number   Name Country  Age        Job
0       0   John     USA   31    Student
1       1  Sabre  France   33     Lawyer
2       2    Kim   Korea   28  Developer
3       3   Sato   Japan   40       Chef
4       4    Lee   Korea   36  Professor
5       5  Smith     USA   55        CEO
6       6  David     USA   48     Banker

In [14]:
df_1st_row = df.loc[0]

df_1st_row

Number           0
Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [15]:

df_1st_4th_row = df.loc[ [0, 3] ]

df_1st_4th_row

   Number  Name Country  Age      Job
0       0  John     USA   31  Student
3       3  Sato   Japan   40     Chef

In [17]:
df

   Number   Name Country  Age        Job
0       0   John     USA   31    Student
1       1  Sabre  France   33     Lawyer
2       2    Kim   Korea   28  Developer
3       3   Sato   Japan   40       Chef
4       4    Lee   Korea   36  Professor
5       5  Smith     USA   55        CEO
6       6  David     USA   48     Banker

In [19]:
df_country_group = df.groupby('Country')

age_average = df_country_group['Age'].mean() #같은국가의 평균값 

print(age_average)

Country
France    33.000000
Japan     40.000000
Korea     32.000000
USA       44.666667
Name: Age, dtype: float64